vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
  if(init)
  {
     // publish the init message
    StaticJsonDocument<MAX_MESSAGE_LEN> init_msg_json;//It is recommended to create a new obj than reuse the earlier one by ArduinoJson
    init_msg_json["version"] = compile_version;
    init_msg_json["tot_memKB"] = (float)ESP.getFlashChipSize() / 1024.0;
    init_msg_json["mac"] = WiFi.macAddress();
    init_msg_json["macAP"] = WiFi.softAPmacAddress();
    init_msg_json["wifiChannel"] = WiFi.channel();
    strcpy(publish_topic,MQTT_TOPIC);
    strcat(publish_topic,"/init");
    str_msg="";
    serializeJson(init_msg_json,str_msg);
    return publishToMQTT(str_msg.c_str(),publish_topic,true);
  }
  else
  {
    StaticJsonDocument<MAX_MESSAGE_LEN> msg_json;
    msg_json["uptime"] = millis()/1000; //publish uptime in seconds
    msg_json["mem_freeKB"] = serialized(String((float)ESP.getFreeHeap()/ 1024.0,0));//Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/
    msg_json["msg_count"] = message_count;
    msg_json["queue_len"] = structQueue.itemCount();
    float message_rate = (message_count - last_message_count)/(float)(HEALTH_INTERVAL/(60*1000));//rate calculated over one minute
    last_message_count = message_count;//reset the count
    msg_json["msg_rate"] = serialized(String(message_rate,1));//format with 1 decimal places, Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/

    // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
    strcpy(publish_topic,MQTT_TOPIC);
    strcat(publish_topic,"/state");
    serializeJson(msg_json,str_msg);
    if(publishToMQTT(str_msg.c_str(),publish_topic,false))
    {
      // publish the wifi message , I am publishing this everytime because it also has rssi
      String strIP_address = WiFi.localIP().toString();
      StaticJsonDocument<MAX_MESSAGE_LEN> wifi_msg_json;//It is recommended to create a new obj than reuse the earlier one by ArduinoJson
      wifi_msg_json["ip_address"] = strIP_address;
      wifi_msg_json["rssi"] = WiFi.RSSI();
      strcpy(publish_topic,MQTT_TOPIC);
      strcat(publish_topic,"/wifi");
      str_msg="";
      serializeJson(wifi_msg_json,str_msg);
      return publishToMQTT(str_msg.c_str(),publish_topic,true);
   }
  }
  return false;//control will never come here
}

void printInitInfo()
{
  DPRINTLN("Starting up as a ESPNow Gateway");
  #if USING(MOTION_SENSOR)
    DPRINTLN("Motion sensor ON");
  #else
    DPRINTLN("Motion sensor OFF");
  #endif
  #if USING(SECURITY)
    DPRINTLN("Security ON");
  #else
    DPRINTLN("Security OFF");
  #endif

}

void notFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "Not found");
}

/*
 * repeatedly sends OTA message to an ESP for a certain duration 
 * param: peerAddress: address of the peer as an uint8 array
 * param: duration : duration in sec for which to keep sending this message
 * param: stop_on_delivery : flag to indicate it it should stop sending messages once it gets the delivery confirmation
 */
void prepare_for_OTA(uint8_t peerAddress[])
{
//  espnow_message myData;
  #if(USING(SECURITY))
    refreshPeer(peerAddress, key,RECEIVER_ROLE);
  #else
    refreshPeer(peerAddress, NULL,RECEIVER_ROLE);
  #endif
  // If devicename is not given then generate one from MAC address stripping off the colon
  #ifdef DEVICE_NAME
    strcpy(myData.device_name,DEVICE_NAME);
  #else
    String wifiMacString = WiFi.macAddress();
    wifiMacString.replace(":","");
    snprintf(myData.device_name, 16, "%s", wifiMacString.c_str());
  #endif
  myData.msg_type = ESPNOW_OTA;
  esp_ota_device.ota_mode = true; // set the ota flag which will trigger the OTA flow in loop()
  esp_ota_device.ota_done = false; // reset the success flag
  start_time = millis(); // start the timer
  DPRINTLN("OTA prepared for device");
}

void config_webserver()
{
  // Handles root page
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html);
  });

  // Handles OTA request for an ESPNOW device
  server.on("/espnowota", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String mac_addr , response_msg;
    // OTA can be triggered only for one device at a time, reject this request if one is already in progress
    if(!esp_ota_device.ota_mode)
    {
      if (request->hasParam(input_param_mac)) {
        mac_addr = request->getParam(input_param_mac)->value();
        if(validate_MAC(mac_addr.c_str()))
        {
          DPRINTFLN("MAC %s is valid %02X:%02X:%02X:%02X:%02X:%02X",mac_addr.c_str(),esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5]);
          mac_addr.replace(MAC_DELIMITER,"");
          MAC_to_array(mac_addr.c_str(),esp_ota_device.mac,6);
          prepare_for_OTA(esp_ota_device.mac);
          response_msg = "ESPNOW OTA req sent to device: ";
        }
        else
        {
          response_msg = "MAC address provided in invalid : ";
          DPRINTFLN("MAC %s is invalid",mac_addr.c_str());
        }
      }
      else 
      {
        mac_addr = "none";
      }
    }
    else
    {
      char buffer[18];
      sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
      response_msg = "OTA already in progress for device: " + String(buffer);
      DPRINTLN(response_msg);
    }
    request->send(200, "text/html", response_msg + mac_addr + " <br><a href=\"/\">Return to Home Page</a>");
  });
  server.onNotFound(notFound);
  server.begin();  
}

/*
 * Initializes the ESP with espnow and WiFi client , OTA etc
 */
void setup() {
  // Initialize Serial Monitor , if we're usng pin 3 on ESP8266 for PIR then initialize Serial as Tx only , disable Rx
  #if USING(MOTION_SENSOR)
  if(PIR_PIN == 3)
    {DBEGIN(115200, SERIAL_8N1, SERIAL_TX_ONLY);}
  else
    {DBEGIN(115200);}
  #else
    {DBEGIN(115200);}
  #endif

  printInitInfo();

  // Set the device as a Station and Soft Access Point simultaneously
  WiFi.mode(WIFI_AP_STA); // This has to be WIFI_AP_STA and not WIFI_STA, I dont know why but if set to WIFI_STA then it can only receive broadcast messages
  // and stops receiving MAC specific messages.
  // Set a custom MAC address for the device. This is helpful in cases where you want to replace the actual ESP device in future
  // A custom MAC address will allow all sensors to continue working with the new device and you will not be required to update code on all devices
  uint8_t customMACAddress[] = DEVICE_MAC; // defined in Config.h
  if(wifi_set_macaddr(SOFTAP_IF, &customMACAddress[0]))
    { DPRINT("Successfully set a custom MAC address as:");
      DPRINTLN(WiFi.softAPmacAddress());
    }
    else
    {DPRINT("Failed to set custom MAC address:");}

  pinMode(STATUS_LED,OUTPUT);
  WiFi.config(ESP_IP_ADDRESS, default_gateway, subnet_mask);//from secrets.h
  String device_name = DEVICE_NAME;
  device_name.replace("_","-");//hostname dont allow underscores or spaces
  WiFi.hostname(device_name.c_str());// Set Hostname.


  // For Station Mode
  //wifi_set_macaddr(STATION_IF, &newMACAddress[0]);

  // Set device as a Wi-Fi Station
  WiFi.begin(ssid, password);
  DPRINTLN("Setting as a Wi-Fi Station..");
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    DPRINT(".");
  }
  DPRINT("Station IP Address: ");
  DPRINTLN(WiFi.localIP());
  DPRINT("Wi-Fi Channel: ");
  DPRINTLN(WiFi.channel());
  WiFi.setAutoReconnect(true);

  if((WiFi.status() == WL_CONNECTED))
  {
    client.setServer(mqtt_broker, mqtt_port);// from secrets.h
  }
  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    DPRINTLN("Error initializing ESP-NOW");
    return;
  }
  
  esp_now_set_self_role(MY_ROLE);
  #if USING(SECURITY)
  // Setting the PMK key
  esp_now_set_kok(kok, KEY_LEN);
  byte channel = wifi_get_channel();
  // Add each controller who is expected to send a message to this gateway
  for(byte i = 0;i< sizeof(controller_mac)/6;i++)
  {
    esp_now_add_peer(controller_mac[i], RECEIVER_ROLE, channel, key, KEY_LEN);
    DPRINTFLN("Added controller :%02X:%02X:%02X:%02X:%02X:%02X",controller_mac[i][0],controller_mac[i][1],controller_mac[i][2],controller_mac[i][3],controller_mac[i][4],controller_mac[i][5] );
  }
   #endif

  esp_now_register_send_cb(OnDataSent);
  esp_now_register_recv_cb(OnDataRecv);
  DPRINT("WiFi address:");DPRINTLN(WiFi.macAddress());
  DPRINT("SoftAP address:");DPRINTLN(WiFi.softAPmacAddress());

  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else { // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    DPRINTLN("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    DPRINTLN("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    DPRINTF("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    DPRINTF("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      DPRINTLN("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      DPRINTLN("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      DPRINTLN("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      DPRINTLN("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      DPRINTLN("End Failed");
    }
  });
  ArduinoOTA.begin();

